<!DOCTYPE HTML>
<html lang="en" >
    
    <head>
        
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <title>编辑和删除文本 | Atom Flight Manual</title>
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <meta name="description" content="">
        <meta name="generator" content="GitBook 2.6.7">
        
        
        <meta name="HandheldFriendly" content="true"/>
        <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
        <meta name="apple-mobile-web-app-capable" content="yes">
        <meta name="apple-mobile-web-app-status-bar-style" content="black">
        <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
        <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">
        
    <link rel="stylesheet" href="../gitbook/style.css">
    
        
        <link rel="stylesheet" href="../gitbook/plugins/gitbook-plugin-highlight/website.css">
        
    
        
        <link rel="stylesheet" href="../gitbook/plugins/gitbook-plugin-search/search.css">
        
    
        
        <link rel="stylesheet" href="../gitbook/plugins/gitbook-plugin-fontsettings/website.css">
        
    
    

        
    
    
    
    <link rel="prev" href="../chapter-2-using-atom/atom-selections.html" />
    

        
    </head>
    <body>
        
        
    <div class="book"
        data-level="2.2"
        data-chapter-title="编辑和删除文本"
        data-filepath="chapter-2-using-atom/editing-and-deleting-text.md"
        data-basepath=".."
        data-revision="Thu May 12 2016 13:25:20 GMT+0800 (中国标准时间)"
        data-innerlanguage="">
    

<div class="book-summary">
    <nav role="navigation">
        <ul class="summary">
            
            
            
            

            

            
    
        <li class="chapter " data-level="0" data-path="index.html">
            
                
                    <a href="../index.html">
                
                        <i class="fa fa-check"></i>
                        
                        Introduction
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="1" data-path="chapter-1-getting-started/index.html">
            
                
                    <a href="../chapter-1-getting-started/index.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>1.</b>
                        
                        第一章：新手入门
                    </a>
            
            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.1" data-path="chapter-1-getting-started/why-atom.html">
            
                
                    <a href="../chapter-1-getting-started/why-atom.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>1.1.</b>
                        
                        为什么选择 Atom？
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="chapter-1-getting-started/atom-basics.html">
            
                
                    <a href="../chapter-1-getting-started/atom-basics.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>1.2.</b>
                        
                        Atom 基础
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="chapter-1-getting-started/installing-atom.html">
            
                
                    <a href="../chapter-1-getting-started/installing-atom.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>1.3.</b>
                        
                        安装 Atom
                    </a>
            
            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="2" data-path="chapter-2-using-atom/index.html">
            
                
                    <a href="../chapter-2-using-atom/index.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.</b>
                        
                        第二章：使用 Atom
                    </a>
            
            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.1" data-path="chapter-2-using-atom/atom-selections.html">
            
                
                    <a href="../chapter-2-using-atom/atom-selections.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.1.</b>
                        
                        Atom 文本选择
                    </a>
            
            
        </li>
    
        <li class="chapter active" data-level="2.2" data-path="chapter-2-using-atom/editing-and-deleting-text.html">
            
                
                    <a href="../chapter-2-using-atom/editing-and-deleting-text.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.2.</b>
                        
                        编辑和删除文本
                    </a>
            
            
        </li>
    

            </ul>
            
        </li>
    


            
            <li class="divider"></li>
            <li>
                <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
                    Published with GitBook
                </a>
            </li>
            
        </ul>
    </nav>
</div>

    <div class="book-body">
        <div class="body-inner">
            <div class="book-header" role="navigation">
    <!-- Actions Left -->
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../" >Atom Flight Manual</a>
    </h1>
</div>

            <div class="page-wrapper" tabindex="-1" role="main">
                <div class="page-inner">
                
                
                    <section class="normal" id="section-">
                    
                        <h1 id="&#x7F16;&#x8F91;&#x548C;&#x5220;&#x9664;&#x6587;&#x672C;">&#x7F16;&#x8F91;&#x548C;&#x5220;&#x9664;&#x6587;&#x672C;</h1>
<p>&#x81F3;&#x6B64;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5B66;&#x4E60;&#x4E86;&#x5F88;&#x591A;&#x5728;&#x6587;&#x4EF6;&#x4E2D;&#x79FB;&#x52A8;&#x548C;&#x9009;&#x62E9;&#x533A;&#x57DF;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x90A3;&#x4E48;&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x5B9E;&#x9645;&#x4FEE;&#x6539;&#x4E00;&#x4E9B;&#x6587;&#x672C;&#x5427;&#xFF01;&#x867D;&#x7136;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6253;&#x5B57;&#x6765;&#x63D2;&#x5165;&#x5B57;&#x7B26;&#xFF0C;&#x4F46;&#x662F;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x7528;&#x4E8E;&#x5220;&#x9664;&#x548C;&#x5904;&#x7406;&#x6587;&#x672C;&#x7684;&#x65B9;&#x6CD5;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x7528;&#x5F97;&#x4E0A;&#x3002;</p>
<h2 id="&#x57FA;&#x672C;&#x64CD;&#x4F5C;">&#x57FA;&#x672C;&#x64CD;&#x4F5C;</h2>
<p>&#x6709;&#x4E00;&#x4E9B;&#x7B80;&#x4FBF;&#x6613;&#x7528;&#x7684;&#x5F88;&#x9177;&#x7684;&#x5FEB;&#x6377;&#x952E;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x8FDB;&#x884C;&#x57FA;&#x672C;&#x6587;&#x672C;&#x64CD;&#x4F5C;&#xFF0C;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x6587;&#x672C;&#x884C;&#x4E4B;&#x95F4;&#x79FB;&#x52A8;&#xFF0C;&#x590D;&#x5236;&#x6587;&#x672C;&#x884C;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x6539;&#x53D8;&#x5B57;&#x6BCD;&#x5927;&#x5C0F;&#x5199;&#x3002;</p>
<p><code>ctrl-T</code>&#xFF1A;&#x5B57;&#x7B26;&#x53D8;&#x6362;&#x3002;&#x4EA4;&#x6362;&#x5149;&#x6807;&#x4E24;&#x4FA7;&#x7684;&#x5B57;&#x7B26;</p>
<p><code>cmd-J</code>&#xFF1A;&#x5C06;&#x4E0B;&#x4E00;&#x884C;&#x62FC;&#x63A5;&#x5230;&#x5F53;&#x524D;&#x884C;&#x7684;&#x672B;&#x5C3E;</p>
<p><code>ctrl-cmd-up</code>&#xFF0C;<code>ctrl-cmd-down</code>&#xFF1A;&#x4E0A;&#x79FB;&#x6216;&#x4E0B;&#x79FB;&#x5F53;&#x524D;&#x884C;</p>
<p><code>cmd-shift-D</code>&#xFF1A;&#x590D;&#x5236;&#x5F53;&#x524D;&#x884C;</p>
<p><code>cmd-K</code>&#xFF0C;<code>cmd-U</code>&#xFF1A;&#x5C06;&#x5F53;&#x524D;&#x5355;&#x8BCD;&#x8F6C;&#x6362;&#x4E3A;&#x5927;&#x5199;&#x5B57;&#x6BCD;</p>
<p><code>cmd-K</code>&#xFF0C;<code>cmd-L</code>&#xFF1A;&#x5C06;&#x5F53;&#x524D;&#x5355;&#x8BCD;&#x8F6C;&#x4E3A;&#x5C0F;&#x5199;&#x5B57;&#x6BCD;</p>
<p>Atom &#x8FD8;&#x5185;&#x7F6E;&#x4E86;&#x4E00;&#x4E2A;&#x5BF9;&#x6BB5;&#x843D;&#x8FDB;&#x884C;&#x91CD;&#x65B0;&#x6392;&#x7248;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x5F53;&#x4E00;&#x884C;&#x7684;&#x957F;&#x5EA6;&#x8D85;&#x51FA;&#x4E86;&#x6700;&#x5927;&#x786C;&#x6362;&#x884C;&#xFF08; hard-wrap &#xFF09;&#x957F;&#x5EA6;&#x65F6;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; cmd-alt-Q &#x6765;&#x5BF9;&#x5F53;&#x524D;&#x9009;&#x4E2D;&#x533A;&#x57DF;&#x8FDB;&#x884C;&#x6392;&#x7248;&#xFF0C;&#x4F7F;&#x5176;&#x6BCF;&#x4E00;&#x884C;&#x7684;&#x957F;&#x5EA6;&#x4E0D;&#x8D85;&#x8FC7; 80 &#x4E2A;&#x5B57;&#x7B26;&#xFF08;&#x4F60;&#x53EF;&#x4EE5;&#x5728; editor.preferredLineLength &#x4E2D;&#x4FEE;&#x6539;&#x8FD9;&#x4E2A;&#x9ED8;&#x8BA4;&#x503C;&#xFF09;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x9009;&#x4E2D;&#x4EFB;&#x4F55;&#x6587;&#x672C;&#xFF0C;&#x5219;&#x5F53;&#x524D;&#x7684;&#x6BB5;&#x843D;&#x4F1A;&#x88AB;&#x91CD;&#x6392;&#x3002;</p>
<h2 id="&#x5220;&#x9664;&#x548C;&#x526A;&#x5207;">&#x5220;&#x9664;&#x548C;&#x526A;&#x5207;</h2>
<p>&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x4E00;&#x4E9B;&#x5FEB;&#x6377;&#x952E;&#x4ECE;&#x7F13;&#x51B2;&#x533A;&#x4E2D;&#x5220;&#x9664;&#x548C;&#x526A;&#x5207;&#x6587;&#x672C;&#x3002;&#x4E0D;&#x8981;&#x624B;&#x4E0B;&#x7559;&#x60C5;&#x3002;</p>
<p><code>ctrl-shift-K</code>&#xFF1A;&#x5220;&#x9664;&#x5F53;&#x524D;&#x884C;</p>
<p><code>cmd-delete</code>&#xFF1A;&#x5220;&#x9664;&#x4ECE;&#x5F53;&#x524D;&#x4F4D;&#x7F6E;&#x5230;&#x672C;&#x884C;&#x672B;&#x5C3E;&#x7684;&#x5185;&#x5BB9;&#xFF08;&#x5728; MAC &#x4E2D;&#x4E3A; <code>cmd-fn-backspace</code> &#xFF09;</p>
<p><code>ctrl-K</code>&#xFF1A;&#x526A;&#x5207;&#x4ECE;&#x5F53;&#x524D;&#x4F4D;&#x7F6E;&#x5230;&#x672C;&#x884C;&#x672B;&#x5C3E;&#x7684;&#x5185;&#x5BB9;</p>
<p><code>cmd-backspace</code>&#xFF1A;&#x5220;&#x9664;&#x4ECE;&#x5F53;&#x524D;&#x4F4D;&#x7F6E;&#x5230;&#x672C;&#x884C;&#x5F00;&#x5934;&#x7684;&#x5185;&#x5BB9;</p>
<p><code>alt-backspace</code>&#xFF0C;<code>alt-H</code>&#xFF1A;&#x5220;&#x9664;&#x4ECE;&#x5F53;&#x524D;&#x4F4D;&#x7F6E;&#x5230;&#x5355;&#x8BCD;&#x5F00;&#x5934;&#x7684;&#x5185;&#x5BB9;</p>
<p><code>alt-delete</code>&#xFF0C;<code>alt-D</code>&#xFF1A;&#x5220;&#x9664;&#x4ECE;&#x5F53;&#x524D;&#x4F4D;&#x7F6E;&#x5230;&#x5355;&#x8BCD;&#x672B;&#x5C3E;&#x7684;&#x5185;&#x5BB9;</p>
<h2 id="&#x591A;&#x5149;&#x6807;&#x9009;&#x62E9;">&#x591A;&#x5149;&#x6807;&#x9009;&#x62E9;</h2>
<p>Atom &#x80FD;&#x505A;&#x5230;&#x4E00;&#x4EF6;&#x5F88;&#x9177;&#x7684;&#x4E8B;&#xFF0C;&#x5C31;&#x662F;&#x591A;&#x5149;&#x6807;&#x652F;&#x6301;&#x3002;&#x8FD9;&#x5728;&#x5904;&#x7406;&#x4E00;&#x5217;&#x5F88;&#x957F;&#x7684;&#x6587;&#x672C;&#x65F6;&#x4F1A;&#x7279;&#x522B;&#x597D;&#x7528;&#x3002;</p>
<p><code>cmd-click</code>&#xFF1A;&#x6DFB;&#x52A0;&#x65B0;&#x7684;&#x5149;&#x6807;</p>
<p><code>cmd-shift-L</code>&#xFF1A;&#x5C06;&#x591A;&#x884C;&#x9009;&#x62E9;&#x8F6C;&#x6362;&#x4E3A;&#x591A;&#x5149;&#x6807;</p>
<p><code>ctrl-shift-up</code>&#xFF0C;<code>ctrl-shift-down</code>&#xFF1A;&#x5728;&#x5F53;&#x524D;&#x5149;&#x6807;&#x4E0A;&#x65B9;&#x6216;&#x8005;&#x4E0B;&#x65B9;&#x52A0;&#x5165;&#x4E00;&#x4E2A;&#x65B0;&#x5149;&#x6807;</p>
<p><code>cmd-D</code>&#xFF1A;&#x9009;&#x62E9;&#x6587;&#x6863;&#x4E2D;&#x4E0E;&#x5F53;&#x524D;&#x9009;&#x4E2D;&#x5355;&#x8BCD;&#x76F8;&#x540C;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x5355;&#x8BCD;</p>
<p><code>ctrl-cmd-G</code>&#xFF1A;&#x9009;&#x62E9;&#x6587;&#x6863;&#x4E2D;&#x4E0E;&#x5F53;&#x524D;&#x9009;&#x4E2D;&#x5355;&#x8BCD;&#x76F8;&#x540C;&#x7684;&#x6240;&#x6709;&#x5355;&#x8BCD;</p>
<p>&#x7528;&#x8FD9;&#x4E9B;&#x547D;&#x4EE4;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x4F60;&#x7684;&#x6587;&#x6863;&#x7684;&#x591A;&#x4E2A;&#x4F4D;&#x7F6E;&#x653E;&#x7F6E;&#x5149;&#x6807;&#xFF0C;&#x5E76;&#x4E14;&#x9AD8;&#x6548;&#x5730;&#x4E00;&#x6B21;&#x6027;&#x5728;&#x591A;&#x4E2A;&#x4F4D;&#x7F6E;&#x6267;&#x884C;&#x76F8;&#x540C;&#x547D;&#x4EE4;&#x3002;</p>
<p><img src="images/multiple-cursors.gif" alt="&#x4F7F;&#x7528;&#x591A;&#x5149;&#x6807;"></p>
<p>&#x56FE; 1. &#x4F7F;&#x7528;&#x591A;&#x5149;&#x6807;</p>
<p>&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5728;&#x8BF8;&#x5982;&#x91CD;&#x547D;&#x540D;&#x53D8;&#x91CF;&#x6216;&#x8005;&#x4FEE;&#x6539;&#x6587;&#x672C;&#x683C;&#x5F0F;&#x8FD9;&#x7C7B;&#x91CD;&#x590D;&#x4EFB;&#x52A1;&#x7684;&#x65F6;&#x5019;&#x5F88;&#x6709;&#x5E2E;&#x52A9;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x501F;&#x52A9;&#x51E0;&#x4E4E;&#x4EFB;&#x4F55;&#x63D2;&#x4EF6;&#x6216;&#x547D;&#x4EE4;&#x6765;&#x4F7F;&#x7528;&#x5B83;&#x2014;&#x2014;&#x6BD4;&#x5982;&#x8F6C;&#x6362;&#x5B57;&#x6BCD;&#x5927;&#x5C0F;&#x5199;&#xFF0C;&#x4EE5;&#x53CA;&#x79FB;&#x52A8;&#x6216;&#x590D;&#x5236;&#x6587;&#x672C;&#x884C;&#x3002;</p>
<p>&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x6309;&#x4E0B; <code>Command</code> &#x952E;&#x7684;&#x540C;&#x65F6;&#x4F7F;&#x7528;&#x9F20;&#x6807;&#x4E00;&#x6B21;&#x6027;&#x9009;&#x4E2D;&#x4F60;&#x7684;&#x6587;&#x672C;&#x4E2D;&#x7684;&#x591A;&#x4E2A;&#x533A;&#x57DF;&#x3002;</p>
<h2 id="&#x7A7A;&#x767D;&#x5B57;&#x7B26;">&#x7A7A;&#x767D;&#x5B57;&#x7B26;</h2>
<p>Atom &#x81EA;&#x5E26;&#x4E86;&#x4E00;&#x4E9B;&#x547D;&#x4EE4;&#x6765;&#x5E2E;&#x52A9;&#x4F60;&#x7BA1;&#x7406;&#x4F60;&#x7684;&#x6587;&#x6863;&#x4E2D;&#x7684;&#x7A7A;&#x767D;&#x5B57;&#x7B26;&#x3002;&#x4E00;&#x5BF9;&#x975E;&#x5E38;&#x6709;&#x7528;&#x7684;&#x547D;&#x4EE4;&#x662F;&#x628A;&#x524D;&#x5BFC;&#x7A7A;&#x683C;&#x8F6C;&#x6362;&#x4E3A;&#x5236;&#x8868;&#x7B26;&#xFF08;Tab&#xFF09;&#xFF0C;&#x4EE5;&#x53CA;&#x628A;&#x524D;&#x5BFC;&#x5236;&#x8868;&#x7B26;&#x8F6C;&#x6362;&#x4E3A;&#x7A7A;&#x683C;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7684;&#x6587;&#x6863;&#x4E2D;&#x6DF7;&#x7528;&#x4E86;&#x591A;&#x79CD;&#x7A7A;&#x767D;&#x5B57;&#x7B26;&#xFF0C;&#x8FD9;&#x4E9B;&#x547D;&#x4EE4;&#x4F1A;&#x5BF9;&#x6587;&#x6863;&#x7684;&#x6807;&#x51C6;&#x5316;&#x6709;&#x5DE8;&#x5927;&#x5E2E;&#x52A9;&#x3002;&#x7A7A;&#x767D;&#x5B57;&#x7B26;&#x547D;&#x4EE4;&#x6CA1;&#x6709;&#x5FEB;&#x6377;&#x952E;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x53EA;&#x80FD;&#x5728;&#x547D;&#x4EE4;&#x9762;&#x677F;&#x4E2D;&#x5BFB;&#x627E;&#x201C; Convert Spaces to Tabs &#xFF08;&#x5C06;&#x7A7A;&#x683C;&#x8F6C;&#x6362;&#x4E3A;&#x5236;&#x8868;&#x7B26;&#xFF09;&#x201D;&#xFF08;&#x6216;&#x8005;&#x76F8;&#x53CD;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x9009;&#x53D6;&#x4E00;&#x4E2A;&#x547D;&#x4EE4;&#x6765;&#x6267;&#x884C;&#x3002;</p>
<p>&#x7A7A;&#x767D;&#x5B57;&#x7B26;&#x547D;&#x4EE4;&#x5728; <a href="https://github.com/atom/whitespace" target="_blank">atom/whitespace</a> &#x5305;&#x4E2D;&#x5B9E;&#x73B0;&#x3002;&#x7A7A;&#x767D;&#x5B57;&#x7B26;&#x547D;&#x4EE4;&#x7684;&#x8BBE;&#x7F6E;&#xFF0C;&#x5728; <code>whitespace</code> &#x5305;&#x7684;&#x9875;&#x9762;&#x4E2D;&#x63D0;&#x4F9B;&#x3002;</p>
<p><img src="images/whitespace.png" alt="whitespace settings"></p>
<p>&#x56FE; 2. &#x7BA1;&#x7406;&#x4F60;&#x7684;&#x7A7A;&#x767D;&#x5B57;&#x7B26;&#x8BBE;&#x7F6E;</p>
<p>&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#x201C; Remove Trailing Whitespace &#xFF08;&#x79FB;&#x9664;&#x672B;&#x5C3E;&#x7A7A;&#x767D;&#x5B57;&#x7B26;&#xFF09;&#x201D;&#x9009;&#x9879;&#x662F;&#x9ED8;&#x8BA4;&#x5F00;&#x542F;&#x7684;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6BCF;&#x5F53;&#x4F60;&#x5728; Atom &#x4E2D;&#x4FDD;&#x5B58;&#x6587;&#x4EF6;&#x65F6;&#xFF0C; Atom &#x90FD;&#x4F1A;&#x53BB;&#x6389;&#x6587;&#x4EF6;&#x672B;&#x5C3E;&#x7684;&#x7A7A;&#x767D;&#x5B57;&#x7B26;&#x3002;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x7981;&#x7528;&#x8FD9;&#x4E2A;&#x9009;&#x9879;&#xFF0C;&#x5728;&#x4F60;&#x7684;&#x8BBE;&#x7F6E;&#x9762;&#x677F;&#x4E2D;&#x6253;&#x5F00; <code>whitespace</code> &#x5305;&#x7684;&#x9875;&#x9762;&#xFF0C;&#x53D6;&#x6D88;&#x52FE;&#x9009;&#x8BE5;&#x9009;&#x9879;&#x3002;</p>
<p>Atom &#x540C;&#x65F6;&#x4E5F;&#x9ED8;&#x8BA4;&#x786E;&#x4FDD;&#x4F60;&#x7684;&#x6587;&#x4EF6;&#x7684;&#x672B;&#x5C3E;&#x6709;&#x4E2A;&#x7A7A;&#x884C;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x4E0A;&#x8FF0;&#x4F4D;&#x7F6E;&#x7981;&#x7528;&#x5B83;&#x3002;</p>
<h2 id="&#x62EC;&#x53F7;">&#x62EC;&#x53F7;</h2>
<p>Atom &#x81EA;&#x5E26;&#x5BF9;&#x62EC;&#x53F7;&#x64CD;&#x4F5C;&#x7684;&#x667A;&#x80FD;&#x7B80;&#x4FBF;&#x7684;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x5F53;&#x4F60;&#x7684;&#x5149;&#x6807;&#x8986;&#x76D6; [] &#xFF0C; () &#x548C; {} &#x65F6;&#xFF0C; Atom &#x4F1A;&#x9ED8;&#x8BA4;&#x9AD8;&#x4EAE;&#x5B83;&#x4EEC;&#x3002;&#x5339;&#x914D;&#x7684; XML &#x548C;  HTML &#x6807;&#x7B7E;&#x4E5F;&#x4F1A;&#x9AD8;&#x4EAE;&#x663E;&#x793A;&#x3002;</p>
<p>Atom &#x4E5F;&#x4F1A;&#x81EA;&#x52A8;&#x5B8C;&#x6210; [] &#xFF0C; () &#xFF0C; {} &#xFF0C; &quot;&quot; &#xFF0C; &apos;&apos; &#xFF0C; &#x201C;&#x201D; &#xFF0C; &#x2018;&#x2019; &#xFF0C; &#xAB;&#xBB; &#xFF0C; &#x2039;&#x203A; &#x548C;&#x53CD;&#x5F15;&#x53F7;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5728;&#x9009;&#x62E9;&#x4E86;&#x4E00;&#x6BB5;&#x6587;&#x672C;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x8F93;&#x5165;&#x4E00;&#x4E2A;&#x5DE6;&#x62EC;&#x53F7;&#xFF0C;Atom &#x4F1A;&#x81EA;&#x52A8;&#x8865;&#x4E0A;&#x4E00;&#x4E2A;&#x53F3;&#x62EC;&#x53F7;&#x6765;&#x628A;&#x8FD9;&#x6BB5;&#x6587;&#x672C;&#x5305;&#x88F9;&#x8D77;&#x6765;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x662F;&#x53E6;&#x5916;&#x4E00;&#x4E9B;&#x6709;&#x8DA3;&#x7684;&#x62EC;&#x53F7;&#x76F8;&#x5173;&#x547D;&#x4EE4;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x3002;</p>
<p><code>ctrl-m</code>&#xFF1A;&#x8DF3;&#x8F6C;&#x5230;&#x5149;&#x6807;&#x4E34;&#x8FD1;&#x7684;&#x62EC;&#x53F7;&#x6240;&#x5339;&#x914D;&#x7684;&#x62EC;&#x53F7;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x5339;&#x914D;&#x7684;&#xFF0C;&#x5C31;&#x8DF3;&#x5230;&#x6700;&#x8FD1;&#x7684;&#x540E;&#x62EC;&#x53F7;&#x3002;</p>
<p><code>ctrl-cmd-m</code>&#xFF1A;&#x9009;&#x62E9;&#x5F53;&#x524D;&#x62EC;&#x53F7;&#x4E2D;&#x6240;&#x6709;&#x6587;&#x672C;</p>
<p><code>alt-cmd-.</code>&#xFF1A;&#x95ED;&#x5408;&#x5F53;&#x524D; XML/HTML &#x6807;&#x7B7E;</p>
<p>&#x62EC;&#x53F7;&#x529F;&#x80FD;&#x5728; <a href="https://github.com/atom/bracket-matcher" target="_blank">atom/bracket-matcher</a> &#x5305;&#x4E2D;&#x5B9E;&#x73B0;&#x3002;&#x548C;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x5305;&#x4E00;&#x6837;&#xFF0C;&#x60F3;&#x8981;&#x4FEE;&#x6539;&#x62EC;&#x53F7;&#x64CD;&#x4F5C;&#x76F8;&#x5173;&#x7684;&#x9ED8;&#x8BA4;&#x884C;&#x4E3A;&#xFF0C;&#x6216;&#x8005;&#x76F4;&#x63A5;&#x7981;&#x7528;&#x5B83;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x6D4F;&#x89C8;&#x8BBE;&#x7F6E;&#x89C6;&#x56FE;&#x4E2D;&#x8FD9;&#x4E2A;&#x5305;&#x7684;&#x9875;&#x9762;&#x3002;</p>
<h2 id="&#x6587;&#x4EF6;&#x7F16;&#x7801;">&#x6587;&#x4EF6;&#x7F16;&#x7801;</h2>
<p>&#x5982;&#x679C;&#x4F60;&#x53D1;&#x73B0;&#x4F60;&#x6B63;&#x5728;&#x5904;&#x7406;&#x975E; <code>UTF-8</code> &#x7F16;&#x7801;&#x7684;&#x6587;&#x4EF6;&#x65F6;&#xFF0C;&#x6216;&#x8005;&#x4F60;&#x6253;&#x7B97;&#x521B;&#x5EFA;&#x8FD9;&#x6837;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0; Atom &#x8FD8;&#x81EA;&#x5E26;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x7684;&#x6587;&#x4EF6;&#x7F16;&#x7801;&#x652F;&#x6301;&#x3002;</p>
<p><code>ctrl-shift-U</code>&#xFF1A;&#x6FC0;&#x6D3B;&#x6587;&#x4EF6;&#x7F16;&#x7801;&#x83DC;&#x5355;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x6253;&#x5F00;&#x6587;&#x4EF6;&#x7F16;&#x7801;&#x83DC;&#x5355;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x4E00;&#x79CD;&#x7F16;&#x7801;&#x6765;&#x4FDD;&#x5B58;&#x4F60;&#x7684;&#x6587;&#x4EF6;&#x3002;</p>
<p>&#x5F53;&#x4F60;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;Atom &#x5C06;&#x4F1A;&#x81EA;&#x52A8;&#x68C0;&#x6D4B;&#x6587;&#x4EF6;&#x7F16;&#x7801;&#x3002;&#x5982;&#x679C; Atom &#x65E0;&#x6CD5;&#x8BC6;&#x522B;&#xFF0C;&#x6587;&#x4EF6;&#x7F16;&#x7801;&#x5C06;&#x4F1A;&#x9ED8;&#x8BA4;&#x8BBE;&#x7F6E;&#x4E3A; UTF-8 &#xFF0C;&#x4E4B;&#x540E;&#x65B0;&#x5EFA;&#x7684;&#x6587;&#x4EF6;&#x4E5F;&#x5C06;&#x5E94;&#x7528;&#x6B64;&#x9ED8;&#x8BA4;&#x503C;&#x3002;</p>
<p><img src="images/encodings.png" alt="file encodings"></p>
<p>&#x56FE; 3. &#x4FEE;&#x6539;&#x6587;&#x4EF6;&#x7F16;&#x7801;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x6253;&#x5F00;&#x7F16;&#x7801;&#x83DC;&#x5355;&#x5E76;&#x5C06;&#x5F53;&#x524D;&#x6587;&#x4EF6;&#x7684;&#x7F16;&#x7801;&#x4FEE;&#x6539;&#x4E3A;&#x5176;&#x4ED6;&#x7F16;&#x7801;&#xFF0C;&#x5F53;&#x4F60;&#x4E0B;&#x6B21;&#x4FDD;&#x5B58;&#x8BE5;&#x6587;&#x4EF6;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8BE5;&#x6587;&#x4EF6;&#x5C06;&#x4EE5;&#x6B64;&#x7F16;&#x7801;&#x6765;&#x8F93;&#x51FA;&#x3002;</p>
<p>&#x7F16;&#x7801;&#x9009;&#x62E9;&#x5668;&#x5728; <a href="https://github.com/atom/encoding-selector" target="_blank">atom/encoding-selector</a> &#x5305;&#x4E2D;&#x5B9E;&#x73B0;&#x3002;</p>

                    
                    </section>
                
                
                </div>
            </div>
        </div>

        
        <a href="../chapter-2-using-atom/atom-selections.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: Atom 文本选择"><i class="fa fa-angle-left"></i></a>
        
        
    </div>
</div>

        
<script src="../gitbook/app.js"></script>

    
    <script src="../gitbook/plugins/gitbook-plugin-search/lunr.min.js"></script>
    

    
    <script src="../gitbook/plugins/gitbook-plugin-search/search.js"></script>
    

    
    <script src="../gitbook/plugins/gitbook-plugin-sharing/buttons.js"></script>
    

    
    <script src="../gitbook/plugins/gitbook-plugin-fontsettings/buttons.js"></script>
    

    
    <script src="../gitbook/plugins/gitbook-plugin-livereload/plugin.js"></script>
    

<script>
require(["gitbook"], function(gitbook) {
    var config = {"highlight":{},"search":{"maxIndexSize":1000000},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"livereload":{}};
    gitbook.start(config);
});
</script>

        
    </body>
    
</html>
