<!DOCTYPE HTML>
<html lang="en" >
    
    <head>
        
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <title>为什么选择 Atom？ | Atom Flight Manual</title>
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <meta name="description" content="">
        <meta name="generator" content="GitBook 2.6.7">
        
        
        <meta name="HandheldFriendly" content="true"/>
        <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
        <meta name="apple-mobile-web-app-capable" content="yes">
        <meta name="apple-mobile-web-app-status-bar-style" content="black">
        <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
        <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">
        
    <link rel="stylesheet" href="../gitbook/style.css">
    
        
        <link rel="stylesheet" href="../gitbook/plugins/gitbook-plugin-highlight/website.css">
        
    
        
        <link rel="stylesheet" href="../gitbook/plugins/gitbook-plugin-search/search.css">
        
    
        
        <link rel="stylesheet" href="../gitbook/plugins/gitbook-plugin-fontsettings/website.css">
        
    
    

        
    
    
    <link rel="next" href="../chapter-1-getting-started/atom-basics.html" />
    
    
    <link rel="prev" href="../chapter-1-getting-started/index.html" />
    

        
    </head>
    <body>
        
        
    <div class="book"
        data-level="1.1"
        data-chapter-title="为什么选择 Atom？"
        data-filepath="chapter-1-getting-started/why-atom.md"
        data-basepath=".."
        data-revision="Thu May 12 2016 13:25:20 GMT+0800 (中国标准时间)"
        data-innerlanguage="">
    

<div class="book-summary">
    <nav role="navigation">
        <ul class="summary">
            
            
            
            

            

            
    
        <li class="chapter " data-level="0" data-path="index.html">
            
                
                    <a href="../index.html">
                
                        <i class="fa fa-check"></i>
                        
                        Introduction
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="1" data-path="chapter-1-getting-started/index.html">
            
                
                    <a href="../chapter-1-getting-started/index.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>1.</b>
                        
                        第一章：新手入门
                    </a>
            
            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.1" data-path="chapter-1-getting-started/why-atom.html">
            
                
                    <a href="../chapter-1-getting-started/why-atom.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>1.1.</b>
                        
                        为什么选择 Atom？
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="chapter-1-getting-started/atom-basics.html">
            
                
                    <a href="../chapter-1-getting-started/atom-basics.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>1.2.</b>
                        
                        Atom 基础
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="chapter-1-getting-started/installing-atom.html">
            
                
                    <a href="../chapter-1-getting-started/installing-atom.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>1.3.</b>
                        
                        安装 Atom
                    </a>
            
            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="2" data-path="chapter-2-using-atom/index.html">
            
                
                    <a href="../chapter-2-using-atom/index.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.</b>
                        
                        第二章：使用 Atom
                    </a>
            
            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.1" data-path="chapter-2-using-atom/atom-selections.html">
            
                
                    <a href="../chapter-2-using-atom/atom-selections.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.1.</b>
                        
                        Atom 文本选择
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="chapter-2-using-atom/editing-and-deleting-text.html">
            
                
                    <a href="../chapter-2-using-atom/editing-and-deleting-text.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.2.</b>
                        
                        编辑和删除文本
                    </a>
            
            
        </li>
    

            </ul>
            
        </li>
    


            
            <li class="divider"></li>
            <li>
                <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
                    Published with GitBook
                </a>
            </li>
            
        </ul>
    </nav>
</div>

    <div class="book-body">
        <div class="body-inner">
            <div class="book-header" role="navigation">
    <!-- Actions Left -->
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../" >Atom Flight Manual</a>
    </h1>
</div>

            <div class="page-wrapper" tabindex="-1" role="main">
                <div class="page-inner">
                
                
                    <section class="normal" id="section-">
                    
                        <h1 id="&#x4E3A;&#x4EC0;&#x4E48;&#x9009;&#x62E9;-atom&#xFF1F;">&#x4E3A;&#x4EC0;&#x4E48;&#x9009;&#x62E9; Atom&#xFF1F;</h1>
<p>&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x6709;&#x90A3;&#x4E48;&#x591A;&#x79CD;&#x7F16;&#x8F91;&#x5668;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4F60;&#x8981;&#x82B1;&#x65F6;&#x95F4;&#x5B66;&#x4E60;&#x548C;&#x4F7F;&#x7528; Atom &#x5462;&#xFF1F;</p>
<p>&#x867D;&#x7136; Sublime &#x548C; TextMate &#x4E4B;&#x7C7B;&#x7684;&#x7F16;&#x8F91;&#x5668;&#x5DF2;&#x7ECF;&#x975E;&#x5E38;&#x597D;&#x7528;&#x4E86;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x4EC5;&#x63D0;&#x4F9B;&#x4E86;&#x5F88;&#x6709;&#x9650;&#x7684;&#x62D3;&#x5C55;&#x6027;&#x3002;&#x800C;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x6781;&#x7AEF;&#xFF0C;Emacs &#x548C; Vim &#x63D0;&#x4F9B;&#x4E86;&#x7075;&#x6D3B;&#x7684;&#x62D3;&#x5C55;&#x6027;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x5E76;&#x4E0D;&#x662F;&#x5F88;&#x53CB;&#x597D;&#xFF0C;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x4E13;&#x7528;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x6765;&#x914D;&#x7F6E;&#x548C;&#x62D3;&#x5C55;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x89C9;&#x5F97;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x505A;&#x5F97;&#x66F4;&#x597D;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x6807;&#x662F;&#x5728;&#x4FDD;&#x8BC1;&#x6613;&#x7528;&#x6027;&#x7684;&#x540C;&#x65F6;&#x63D0;&#x4F9B;&#x5145;&#x5206;&#x7684;&#x53EF;&#x62D3;&#x5C55;&#x6027;&#xFF08;hackability&#xFF09;&#xFF1A;&#x8FD9;&#x4E2A;&#x7F16;&#x8F91;&#x5668;&#x4F1A;&#x53D7;&#x5230;&#x7B2C;&#x4E00;&#x5929;&#x5B66;&#x4E60;&#x7F16;&#x7A0B;&#x7684;&#x65B0;&#x751F;&#x6B22;&#x8FCE;&#xFF0C;&#x800C;&#x4E14;&#x5F53;&#x4ED6;&#x4EEC;&#x6210;&#x957F;&#x4E3A;&#x7F16;&#x7A0B;&#x4E13;&#x5BB6;&#x65F6;&#x4E5F;&#x96BE;&#x4EE5;&#x5272;&#x820D;&#x3002;</p>
<p>&#x5F53;&#x6211;&#x4EEC;&#x4F7F;&#x7528; Atom &#x6765;&#x5F00;&#x53D1; Atom &#x7684;&#x65F6;&#x5019;&#xFF0C;&#x968F;&#x7740;&#x5B83;&#x7684;&#x9010;&#x6E10;&#x5B8C;&#x5584;&#xFF0C;&#x6211;&#x4EEC;&#x6108;&#x53D1;&#x89C9;&#x5F97;&#x5DF2;&#x7ECF;&#x79BB;&#x4E0D;&#x5F00;&#x5B83;&#x4E86;&#x3002;&#x4ECE;&#x8868;&#x9762;&#x4E0A;&#x6765;&#x770B;&#xFF0C;Atom &#x662F;&#x4E00;&#x4E2A;&#x80FD;&#x6EE1;&#x8DB3;&#x4F60;&#x7684;&#x671F;&#x5F85;&#x7684;&#xFF0C;&#x73B0;&#x4EE3;&#x5316;&#x7684;&#x684C;&#x9762;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#xFF0C;&#x800C;&#x5728;&#x8868;&#x9762;&#x4E4B;&#x4E0B;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x503C;&#x5F97;&#x4F60;&#x53BB;&#x4E00;&#x540C;&#x5B8C;&#x5584;&#x7684;&#x7CFB;&#x7EDF;&#x3002;</p>
<h2 id="atom-&#x7684;&#x6838;&#x5FC3;">Atom &#x7684;&#x6838;&#x5FC3;</h2>
<p>Web &#x6280;&#x672F;&#x867D;&#x7136;&#x6709;&#x5176;&#x7F3A;&#x9677;&#xFF0C;&#x4F46;&#x7ECF;&#x8FC7;&#x4E8C;&#x5341;&#x5E74;&#x7684;&#x53D1;&#x5C55;&#xFF0C;Web &#x5DF2;&#x7ECF;&#x9010;&#x6E10;&#x6210;&#x957F;&#x4E3A;&#x4E86;&#x4E00;&#x4E2A;&#x5F3A;&#x5927;&#x7684;&#x5177;&#x6709;&#x6D3B;&#x529B;&#x7684;&#x5E73;&#x53F0;&#x3002;&#x6240;&#x4EE5;&#x5F53;&#x6211;&#x4EEC;&#x8BA1;&#x5212;&#x5199;&#x4E00;&#x4E2A;&#x81EA;&#x7528;&#x7684;&#x53EF;&#x62D3;&#x5C55;&#x7684;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x65F6;&#xFF0C;Web &#x6280;&#x672F;&#x663E;&#x7136;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x4F46;&#x9996;&#x5148;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x6446;&#x8131;&#x6765;&#x81EA; Web &#x7684;&#x9650;&#x5236;&#x3002;</p>
<h3 id="&#x6DF7;&#x5408;&#x672C;&#x5730;&#x4EE3;&#x7801;&#x4E0E;-web-&#x6280;&#x672F;">&#x6DF7;&#x5408;&#x672C;&#x5730;&#x4EE3;&#x7801;&#x4E0E; Web &#x6280;&#x672F;</h3>
<p>Web &#x6D4F;&#x89C8;&#x5668;&#x5F88;&#x9002;&#x5408;&#x7528;&#x6765;&#x6D4F;&#x89C8;&#x7F51;&#x9875;&#xFF0C;&#x4F46;&#x5199;&#x4EE3;&#x7801;&#x662F;&#x4E00;&#x79CD;&#x9700;&#x8981;&#x53EF;&#x9760;&#x7684;&#x5DE5;&#x5177;&#x7684;&#x4E13;&#x4E1A;&#x6D3B;&#x52A8;&#x3002;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x51FA;&#x4E8E;&#x5B89;&#x5168;&#x7684;&#x8003;&#x8651;&#xFF0C;&#x4E25;&#x683C;&#x9650;&#x5236;&#x4E86;&#x5BF9;&#x672C;&#x5730;&#x7CFB;&#x7EDF;&#x7684;&#x8BBF;&#x95EE;&#xFF0C;&#x4F46;&#x5BF9;&#x4E00;&#x4E2A;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x800C;&#x8A00;&#xFF0C;&#x4E0D;&#x80FD;&#x5411;&#x672C;&#x5730;&#x7CFB;&#x7EDF;&#x5199;&#x5165;&#x6587;&#x4EF6;&#x662F;&#x4E0D;&#x53EF;&#x63A5;&#x53D7;&#x7684;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x628A; Atom &#x6784;&#x5EFA;&#x4E3A;&#x4E00;&#x4E2A;&#x4F20;&#x7EDF;&#x7684; Web &#x5E94;&#x7528;&#xFF0C;Atom &#x662F;&#x4E00;&#x4E2A;&#x4E13;&#x95E8;&#x88AB;&#x8BBE;&#x8BA1;&#x7528;&#x4F5C;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7F51;&#x9875;&#x6D4F;&#x89C8;&#x5668;&#x7684; Chromium &#x5B9A;&#x5236;&#x7248;&#x3002;Atom &#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x7A97;&#x53E3;&#x5B9E;&#x9645;&#x4E0A;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x672C;&#x5730;&#x6E32;&#x67D3;&#x7684;&#x7F51;&#x9875;&#x3002;</p>
<p>&#x6240;&#x6709;&#x6765;&#x81EA; Node.js &#x53EF;&#x7528;&#x7684; API &#x5728; Atom &#x7A97;&#x53E3;&#x7684; JavaScript &#x4E2D;&#x540C;&#x6837;&#x53EF;&#x7528;&#xFF0C;&#x8FD9;&#x79CD;&#x7ED3;&#x5408;&#x5E26;&#x6765;&#x4E86;&#x4E00;&#x79CD;&#x72EC;&#x4E00;&#x65E0;&#x4E8C;&#x7684;&#x5F00;&#x53D1;&#x4F53;&#x9A8C;&#x3002;</p>
<p>&#x56E0;&#x4E3A;&#x4E00;&#x5207;&#x90FD;&#x662F;&#x672C;&#x5730;&#x7684;&#xFF0C;&#x4F60;&#x4E0D;&#x9700;&#x8981;&#x5C06;&#x9759;&#x6001;&#x8D44;&#x6E90;&#x6253;&#x5305;&#x3001;&#x4E0D;&#x9700;&#x8981;&#x5173;&#x6CE8;&#x811A;&#x672C;&#x7684;&#x5F02;&#x6B65;&#x52A0;&#x8F7D;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5E0C;&#x671B;&#x52A0;&#x8F7D;&#x4E00;&#x4E9B;&#x4EE3;&#x7801;&#x3002;&#x53EA;&#x9700;&#x8981;&#x5728;&#x6587;&#x4EF6;&#x7684;&#x6700;&#x9876;&#x90E8; <code>require</code> &#x5B83;&#x5373;&#x53EF;&#xFF0C;Node.js &#x7684;&#x6A21;&#x5757;&#x7CFB;&#x7EDF;&#x5141;&#x8BB8;&#x4F60;&#x5C06;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x5206;&#x5272;&#x4E3A;&#x5C0F;&#x7684;&#x3001;&#x4E13;&#x6CE8;&#x4E8E;&#x67D0;&#x4E00;&#x529F;&#x80FD;&#x7684;&#x5305;&#x3002;</p>
<h3 id="javascript-&#x4E0E;-c-&#x7684;&#x7ED3;&#x5408;">JavaScript &#x4E0E; C++ &#x7684;&#x7ED3;&#x5408;</h3>
<p>&#x4E0E;&#x539F;&#x751F;&#x4EE3;&#x7801;&#x4EA4;&#x4E92;&#x4E5F;&#x5F88;&#x7B80;&#x5355;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4F60;&#x57FA;&#x4E8E; Oniguruma &#x6B63;&#x5219;&#x5F15;&#x64CE;&#x5F00;&#x53D1;&#x4E86;&#x4E00;&#x4E2A;&#x7528;&#x6765;&#x63D0;&#x4F9B;&#x5BF9; TextMate &#x8BED;&#x6CD5;&#x8BC6;&#x522B;&#x7684;&#x652F;&#x6301;&#x3002;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x91CC;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x4F7F;&#x7528; NaCl &#x6216; Esprima, &#x800C;&#x5728; Node &#x91CC;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x3002;</p>
<p>&#x5728; Node.js &#x7684; API &#x4E4B;&#x5916;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E9B; API &#x4F8B;&#x5982;&#x4F7F;&#x7528;&#x7CFB;&#x7EDF;&#x7684;&#x5BF9;&#x8BDD;&#x6846;&#x3001;&#x4F7F;&#x7528;&#x83DC;&#x5355;&#x680F;&#x548C;&#x53F3;&#x952E;&#x83DC;&#x5355;&#x3001;&#x64CD;&#x7EB5;&#x7A97;&#x53E3;&#x5C3A;&#x5BF8;&#x7B49;&#x7B49;&#x3002;</p>
<h3 id="web-&#x6280;&#x672F;&#xFF1A;&#x6700;&#x6709;&#x8DA3;&#x7684;&#x90E8;&#x5206;">Web &#x6280;&#x672F;&#xFF1A;&#x6700;&#x6709;&#x8DA3;&#x7684;&#x90E8;&#x5206;</h3>
<p>&#x53E6;&#x4E00;&#x4E2A;&#x597D;&#x6D88;&#x606F;&#x5C31;&#x662F;&#x5F53;&#x4F60;&#x4E3A; Atom &#x7F16;&#x5199;&#x4EE3;&#x7801;&#x65F6;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#x4E00;&#x5B9A;&#x4F1A;&#x88AB;&#x5141;&#x8BB8;&#x5728;&#x6700;&#x65B0;&#x7248;&#x672C;&#x7684; Chromium &#x4E2D;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4F60;&#x53EF;&#x4EE5;&#x65E0;&#x89C6;&#x4E0E;&#x6D4F;&#x89C8;&#x5668;&#x517C;&#x5BB9;&#x6027;&#x6709;&#x5173;&#x7684;&#x9ED1;&#x79D1;&#x6280;&#xFF0C;&#x4F7F;&#x7528;&#x5168;&#x90E8;&#x7684;&#x6700;&#x65B0;&#x7684; Web &#x529F;&#x80FD;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;Atom &#x7684;&#x5DE5;&#x4F5C;&#x533A;&#x548C;&#x7A97;&#x683C;&#x90FD;&#x662F;&#x57FA;&#x4E8E; flexbox &#x6765;&#x8FDB;&#x884C;&#x5E03;&#x5C40;&#x7684;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x9879;&#x521A;&#x521A;&#x51FA;&#x73B0;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x4ECE;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x5B83;&#x4E4B;&#x540E;&#x4E5F;&#x53D1;&#x751F;&#x4E86;&#x5F88;&#x591A;&#x53D8;&#x5316;&#xFF0C;&#x4F46;&#x4E0D;&#x8981;&#x7D27;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5DE5;&#x4F5C;&#x5F97;&#x5F88;&#x597D;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x786E;&#x4FE1;&#x5C06; Atom &#x6784;&#x5EFA;&#x5728; Web &#x6280;&#x672F;&#x4E4B;&#x4E0A;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x56E0;&#x4E3A;&#x6574;&#x4E2A;&#x884C;&#x4E1A;&#x90FD;&#x5728;&#x63A8;&#x52A8;&#x7740; Web &#x6280;&#x672F;&#x7684;&#x53D1;&#x5C55;&#x3002;&#x539F;&#x751F;UI&#x6280;&#x672F;&#x4E0D;&#x65AD;&#x4EA7;&#x751F;&#x53C8;&#x4E0D;&#x65AD;&#x6DD8;&#x6C70;&#xFF0C;&#x800C; Web &#x662F;&#x4E00;&#x4E2A;&#x6BCF;&#x5E74;&#x90FD;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x5F3A;&#x5927;&#x548C;&#x666E;&#x53CA;&#x7684;&#x6807;&#x51C6;&#x3002;&#x6211;&#x4EEC;&#x5BF9;&#x4E8E;&#x6DF1;&#x5165;&#x63A2;&#x7D22;&#x8FD9;&#x4E00;&#x5F3A;&#x5927;&#x7684;&#x6280;&#x672F;&#x611F;&#x5230;&#x65E0;&#x6BD4;&#x5174;&#x594B;&#x3002;</p>
<h2 id="&#x4E00;&#x4E2A;&#x5F00;&#x6E90;&#x7684;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;">&#x4E00;&#x4E2A;&#x5F00;&#x6E90;&#x7684;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;</h2>
<p>GitHub &#x7684;&#x76EE;&#x6807;&#x662F;&#x5E2E;&#x52A9;&#x5927;&#x5BB6;&#x6784;&#x5EFA;&#x66F4;&#x597D;&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;&#x800C; Atom &#x5219;&#x662F;&#x5B9E;&#x73B0;&#x8FD9;&#x4E00;&#x76EE;&#x6807;&#x7684;&#x91CD;&#x8981;&#x8865;&#x5145;&#x3002;Atom &#x662F;&#x4E00;&#x9879;&#x957F;&#x671F;&#x7684;&#x6295;&#x8D44;&#xFF0C;GitHub &#x4F1A;&#x6301;&#x7EED;&#x6295;&#x5165;&#x5F00;&#x53D1;&#x529B;&#x91CF;&#x6765;&#x63A8;&#x52A8;&#x5B83;&#x7684;&#x53D1;&#x5C55;&#x3002;&#x4F46;&#x6211;&#x4EEC;&#x4E5F;&#x610F;&#x8BC6;&#x5230;&#x4E0D;&#x80FD;&#x8BA9;&#x5B83;&#x53D7;&#x9650;&#x4E8E;&#x6211;&#x4EEC;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x5C31;&#x50CF;&#x4E4B;&#x6240;&#x4EE5; Emacs &#x548C; Vim &#x5728;&#x8FC7;&#x53BB;&#x7684;&#x4E09;&#x5341;&#x5E74;&#x95F4;&#x88AB;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x53EA;&#x6709;&#x5F00;&#x6E90;&#xFF0C;&#x624D;&#x80FD;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x6301;&#x4E45;&#x7684;&#x3001;&#x6709;&#x6D3B;&#x529B;&#x7684;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x793E;&#x533A;&#x3002;</p>
<p>&#x6574;&#x4E2A; Atom &#x7F16;&#x8F91;&#x5668;&#x90FD;&#x662F;&#x514D;&#x8D39;&#x4E14;&#x5F00;&#x6E90;&#x7684;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728; <a href="https://github.com/atom" target="_blank">https://github.com/atom</a> &#x8FD9;&#x4E2A;&#x7EC4;&#x7EC7;&#x4E0B;&#x627E;&#x5230;&#x5B83;&#x3002;</p>

                    
                    </section>
                
                
                </div>
            </div>
        </div>

        
        <a href="../chapter-1-getting-started/index.html" class="navigation navigation-prev " aria-label="Previous page: 第一章：新手入门"><i class="fa fa-angle-left"></i></a>
        
        
        <a href="../chapter-1-getting-started/atom-basics.html" class="navigation navigation-next " aria-label="Next page: Atom 基础"><i class="fa fa-angle-right"></i></a>
        
    </div>
</div>

        
<script src="../gitbook/app.js"></script>

    
    <script src="../gitbook/plugins/gitbook-plugin-search/lunr.min.js"></script>
    

    
    <script src="../gitbook/plugins/gitbook-plugin-search/search.js"></script>
    

    
    <script src="../gitbook/plugins/gitbook-plugin-sharing/buttons.js"></script>
    

    
    <script src="../gitbook/plugins/gitbook-plugin-fontsettings/buttons.js"></script>
    

    
    <script src="../gitbook/plugins/gitbook-plugin-livereload/plugin.js"></script>
    

<script>
require(["gitbook"], function(gitbook) {
    var config = {"highlight":{},"search":{"maxIndexSize":1000000},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"livereload":{}};
    gitbook.start(config);
});
</script>

        
    </body>
    
</html>
